{"config": [{"config": {"name": "dropout_1", "dtype": "float32", "rate": 0.5, "trainable": true, "batch_input_shape": [null, 15, 300]}, "class_name": "Dropout"}, {"config": {"name": "conv1d_1", "kernel_regularizer": null, "dilation_rate": [1], "trainable": true, "bias_constraint": null, "strides": [1], "kernel_size": [5], "bias_regularizer": null, "kernel_constraint": null, "activation": "sigmoid", "padding": "valid", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 128, "use_bias": true}, "class_name": "Conv1D"}, {"config": {"name": "global_max_pooling1d_1", "trainable": true}, "class_name": "GlobalMaxPooling1D"}, {"config": {"name": "dense_1", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 125, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dense_2", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 2, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.6"}